#ifndef	__CODINGSWITCH_USER_H__
#define	__CODINGSWITCH_USER_H__

#define		c_codingSwitch_user_en	(0)

#if	(c_codingSwitch_user_en)



/*
K1	K2

A G B
*/

/*************************************************************
***********************IO口定义*******************************
*************************************************************/
//顺时针逆时针调反时可以调换两个IO反过来
#define		p_codingSwitch_io1		PB2		//A	顺时针旋转A先行
#define		p_codingSwitch_io2		PB3		//B 逆时针旋转B先行

#define		p_codingSwitch_io3		PD4		//A	顺时针旋转A先行
#define		p_codingSwitch_io4		PD5		//B 逆时针旋转B先行
	

/*************************************************************
***********************常量定义*******************************
*************************************************************/
#define		c_codingSwitch_interTime	(125)	
//中断基准时间,单位1us

#define		c_codingSwitch_ioShake		(1000/c_codingSwitch_interTime)	
//IO口消抖处理次数，建议时间1ms左右
/*IO口外部如果接的滤波电容较小时旋转编码开关会有高低电平的抖动，不加
消抖处理会导致检测错误而出现漏检，如果消抖时间过长会导致快速旋钮出现
漏检，故消抖时间并非越长越好，消抖过短会导致检测错误也会漏检，加消抖
可以大幅度的降低漏检的概率但并非百分百不会漏检，对于较长时间的抖动
还是会检测错误而漏检但概率很低可以忽视，如果一定要百分百则可以降低
抗干扰性将c_codingSwitch_strengthenMode改为0
*/
#define		c_codingSwitch_strengthenMode	(1)	
//检测强度等级0~2，值越大抗干扰性越强但也许会此出现小概率的漏检
//检测强度,也可以理解为匹配度,等级低部分匹配就可以了,等级高要完全匹配.


/*************************************************************
***********************用户可使用函数申明*********************
*************************************************************/	
	extern	void	codingSwitch_init(void);			
	//IO口初始化
	
	extern	void	codingSwitch_distinguish(uchar cmd);
	extern	void	codingSwitch_distinguish2(uchar cmd);		
	//定时器中断，判断正反转程序
	//cmd	1:使能读取正反转
	//		0:禁能读取
	
	extern	uchar	codingSwitch_get(void); 
	extern	uchar	codingSwitch_get2(void); 
	//正反转状态获取
	//	 0:无动作
	//	 1:正转 c_codingSwitch_s
	//	 2:反转 c_codingSwitch_n
															
	extern	void codingSwitch_deal1();	//编码开关1处理
	extern	void codingSwitch_deal2();	//编码开关2处理


/*************************************************************
***********************当前文件函数申明***********************
*************************************************************/	


/*************************************************************
***********************外部变量申明***************************
*************************************************************/



#endif
#endif
