#include "Config.h"


#if SLEEP_MODE
	/*cubic*/
	// bit Sleep_Flag = 1;
	bit Sleep_Flag = 0;
	uint xdata Sleep_Count = 0;
	void Sleep(void);
#endif

#if SLEEP_MODE
	
	//-----------------------------------------------------------------//
	//函数名称： Sleep_IO_Recovrey()
	//函数功能： Sleep_IO_Recovrey模式还原IO口状态
	//输入参数： 无
	//输出参数： 无
	//返 回 值： 无
	//-----------------------------------------------------------------//
	void Sleep_IO_Recovrey()
	{
	//根据应用还原IO口状态	
	}
	
	void Sleep_Delay_Us(uint us)//1--2.38us@12MHz;10-11.8us@12MHz;100-106us@12MHz;1000-1.045ms
	{
		for (; us > 0; us--)
		{	
			WDT_CTRL = 0x07;
		}		
	}

	//-----------------------------------------------------------------//
	//函数名称： Sleep_IO_Set()
	//函数功能： Sleep模式IO设置,建议将未用到的IO口设置为输出为低
	//输入参数： 无
	//输出参数： 无
	//返 回 值： 无
	//-----------------------------------------------------------------//
	void Sleep_IO_Set()
	{

	}

		//-----------------------------------------------------------------//
	//函数名称： void Sleep()
	//函数功能： 深度休眠模式
	//输入参数： 无
	//输出参数： 无
	//返 回 值： 无
	//-----------------------------------------------------------------//
	void Sleep(void)
	{
		
		if(Sleep_Flag == 1)
		{						

				
				WDT_EN = 0x55;//WDT_ON_OFF(0x55);//关看门狗，仅等于0x55时关闭看门狗
				Sleep_IO_Set();//进入Sleep前IO设置，根据应用需求设置
			
//				Delay_Ms(1);
				
//				BOR_OFF/关掉电复位功能
				Sleep_Delay_Us(100);//执行PCON = 0x01前延时>=100us
				PCON = 0x01;//进入省电模式等待唤醒,在进入省电模式之前，根据实际应用情况来关闭/开启模块中断，唤醒后根据实际应用情况来恢复模块
				
				BOR_ON;//开掉电复位功能
				WDT_EN = 0x00;//WDT_ON_OFF(0);//开看门狗，仅等于0x55时关闭看门狗
				Sleep_IO_Recovrey();//退出省电模式后IO状态设置，根据应用需求设置
				Sleep_Flag=0;
		}
		else
		{
			
		}
				
	}
#endif
