	#include 	"..\Application_Library\Global.h"


	uchar	gb_1ms=0;
	uchar	data	gb_20ms=0;
	uchar	gb_100ms=0;
	uchar	gb_200ms=0;
	uchar	gb_1s=0;

	//
	uchar	xdata	b_checkTime=0;
	//

	
	//
	str_pa	data	gbs_paLayer={0,0,0,0,0};
	//
	


/*-----------------------------------------------------------------
函数名称： void	delay_1us()
函数功能： 延迟1us
输入参数： 无
返 回 值： 无
-----------------------------------------------------------------*/
	void	delay_1us()
	{
	#if	(XS16TK06X)
		#if	(SYSCLK_SEL==0)
			_nop_();
			_nop_();
			_nop_();
			_nop_();
			_nop_();
			_nop_();
		#elif (SYSCLK_SEL==1)
			_nop_();
			_nop_();
			_nop_();
		#else
			#error 自行配置时间
		#endif
	#else
		#error 自行配置时间
	#endif	
		
	}


/*-----------------------------------------------------------------
函数名称： void	delay_2us()
函数功能： 延迟1us
输入参数： 无
返 回 值： 无
-----------------------------------------------------------------*/
	void	delay_2us()
	{
		delay_1us();	
		delay_1us();
	}


/*-----------------------------------------------------------------
函数名称： void	delay_5us()
函数功能： 延迟1us
输入参数： 无
返 回 值： 无
-----------------------------------------------------------------*/
	void	delay_5us()
	{
		delay_1us();	
		delay_1us();
		delay_1us();	
		delay_1us();
		delay_1us();
	}



/*-----------------------------------------------------------------
函数名称： void	MCU_other_Init(void)
函数功能： MCU其他初始化
输入参数： 无
返 回 值： 无
-----------------------------------------------------------------*/
	void	MCU_other_Init()
	{
  		//open_buz(1);

  		//codingSwitch_init();  //编码开关口初始化
  		/*状态初始化*/


		open_buz(2);	//开机音
		//open_buz(5);	//工作完成音
		
	}


/*-----------------------------------------------------------------
函数名称： void	check_deal(void)
函数功能： 上电自检,时间基准100ms
输入参数： 无
返 回 值： 无
-----------------------------------------------------------------*/
	void	check_deal()
	{
    	if(gf_check==0)
    	{
    	    if(b_checkTime>=50)//50 //自检全亮时间
    	    {
    	        gf_check=1;
    	        //open_buz(1);
    	        //自检结束处理
    	    }
    	}
	}


/*-----------------------------------------------------------------
函数名称： void	ledFlash_init()
函数功能： 显示闪烁初始化
输入参数： 无
返 回 值： 无
-----------------------------------------------------------------*/
	void	ledFlash_init()
	{
		gf_flash=0;
		gb_flashTime=0;
	}




///*-----------------------------------------------------------------
//函数名称： void	time_deal(void)
//函数功能： 工作计时处理,时间基准20ms
//输入参数： 无
//返 回 值： 无
//-----------------------------------------------------------------*/
//	void	time_deal()
//	{
//	//--------------------------------闪烁计时
//		if(++gb_flashTime>=25)
//		{
//			gb_flashTime=0;
//			gf_flash=~gf_flash;
//		}
//	//--------------------------------闪烁计时end
//
//	}







